{"meta":{"title":"Hexo","subtitle":"","description":"","author":"Kefei Tu","url":"http://example.com","root":"/"},"pages":[{"title":"Self Introduction","date":"2023-08-27T11:22:55.428Z","updated":"2023-08-27T11:22:55.428Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"I was born in Shanghai, a very beautiful city at the estuary of Yangtze River of the East China Sea. I obtain my bachelor degree of economics and master degree of the computer science from Nankai University, Tianjin. I am very interested in Robotics, Computer Vision and Quantum Computing. Currently, I work for the RockRobo Technology, a nice vacuum cleaner in China. The technology stack of my work is C++ 17, Python. I also wrote some intersting tools with Rust and Typescript."}],"posts":[{"title":"An Essay on Chinese Mid-Autumn Festival","slug":"chinese-lunar-year","date":"2023-09-29T15:57:00.000Z","updated":"2023-09-29T16:32:17.056Z","comments":true,"path":"2023/09/29/chinese-lunar-year/","link":"","permalink":"http://example.com/2023/09/29/chinese-lunar-year/","excerpt":"","text":"Introduction Today is Chinese mid-autumn festival. According to the Chinese's tradition, most people eats moon cakes, a kind of chinese dessert on this day. Generally, there are two kind of moon cakes in china, Su-style and Canton-style. The main charactors that tell one from another are the skin and filling. Su-style cakes have a crisp skin and a meat filling, while the Canton-style have a soft skin with sweet fillings. I still continue to learning real analysis and quantum computing on this day. In the bus back to Ji District, I have found that the word wave is not equal to a periodical function, like sine function. The De Broglie wave is more like a stochastic process, a random variable relevant to the time t, which obey to specific distribution(wave function). Also, I have a strange idea that the laser, is a wave, is a special tornado. The laser is cannot be viewed as a line in the space, but more like a long and slim tornado, slender that the begin point but thick at the end point. It is just a unreliable but interesting good idea. In the fluid dynamics, there are turbulence in different kind of fluids. May be it is a good orientation after I have finished learning enough mathmatics and physics. After countless tries, I must admit that leaning new knowledge, especially effective knowledge, cannot be thoroughly planned. We must have an attitude of keep going to the next station, regardless of the target. In fact, the target cannot be planned because the unknown knowledge cannot be accurately estimated. I must have an open attitute toward leaning new knowledge. Do not feel sad about the aimless learning. Do not fell sad about confusing knowledge beyond understanding. Do feel happy if I have make a little progress!","categories":[{"name":"Diary","slug":"Diary","permalink":"http://example.com/categories/Diary/"}],"tags":[{"name":"Weekly Diary","slug":"Weekly-Diary","permalink":"http://example.com/tags/Weekly-Diary/"}]},{"title":"Summary of Nineth Month in 2023","slug":"nineth-month-2023","date":"2023-09-24T13:05:00.000Z","updated":"2023-09-24T15:08:04.303Z","comments":true,"path":"2023/09/24/nineth-month-2023/","link":"","permalink":"http://example.com/2023/09/24/nineth-month-2023/","excerpt":"","text":"About Learning MathAfter 2 month exploration, I have found a suitable method to learning mathematics, and I have also ability to limit the learning intensity to a reasonable degree. In the first time, I have tried to learning the math by reading the textbook one page by one page. It works well when I was reading the 1st and 2nd chapter. But after the subject is deeply dived, the reading speed become very slowly. In addition, I cannot even understand the content by paragraphs. I become more sensitive to the every new statement that has never been memtioned in the foregoing paragraphs and tried to prove them in my language. Also, only reading books make me ignorant of the big picture of the knowledge system, and get trapped in the local conclusion. Fortunately, I have found good methed to learn math effectively. I called it Onion Peeling method. After much endeavour, I have realized that I cannot go straight through the subject only by reading the textbook. I should learning the math course more than twice. The first stage is to lesson to the video lecture. I must pause the video until I have under stand all the frame in the video. With the lecture taught by the teacher, it helps me keep a proper pace with the input of the knowledge and introduce the backbone part of the course. The second stage is to finish the assignment, important ones rather than quantity. The purpose of this stage is not to thoroughly learn the course, but to understand the video. It gives me a mind cue to show I have open the course door and reach the new start point. The second stage is to carefully read the subsection and finish the exercises keeping me the attraction. Don’t forget to forgive yourself if you give up the hardcore content. It does not mean you are a deserter but just withdrawing for the next attack. The whole process is similar to peel the onion skin. About music learningThis is the third week that I attend MOOC of the music theory. I know that the learning intensity is not very high. But as a beginner, it would cost me a lot time to be accustomed to the strange symbol. I would tried to repeat more than 5 times, 3 times in Chinese and 2 times in English. I cannot resist to such a lesson that if I want to learn a new lesson, mannual handwriting is indispensable for learning in a acceptable speed. The impatience is a truly enemy for learning About the summaryThis is my routine summary. I plan to update it monthly or weekly in my leisure time. The topic is not limited, but many of the most content will be about my life and work. It is also a good tools to help me deposit in my real life and protect me from illusion. Some interesting thing during my writingI found some synonym of the world attack and impatience.Impatinent: irritableattack: assault, offenseI don’t want to get into the usage of words seriously. In this summary, I just want to use simple word to describe my routines clearly. It is not a form of showing off my vocabulary. Compared with the usage of some fashionable word, I am more interested in take good advantange of the common words. Only when I have to take difference for some ambiguous concepts, I would use more advanced words in GRE.","categories":[{"name":"Summary","slug":"Summary","permalink":"http://example.com/categories/Summary/"}],"tags":[{"name":"Daily Summary","slug":"Daily-Summary","permalink":"http://example.com/tags/Daily-Summary/"}]},{"title":"Camera Calibration","slug":"camera-calibration","date":"2023-08-28T11:14:00.000Z","updated":"2023-08-27T13:33:28.930Z","comments":true,"path":"2023/08/28/camera-calibration/","link":"","permalink":"http://example.com/2023/08/28/camera-calibration/","excerpt":"","text":"Motivation I have found that there have been some difference of calibrating result. The calibrated optical center from the same camera of one calibration algorithm varies about 5-7 pixels. In the following article, this problem is called &quot;the optical center pesudo-displacement problem&quot;. In addition, I also found that the calibrating result is not robust with respect to the slight difference of camera placement. From an intuitive view, I think the common difference of optical center is in 0.5 pixels. I think there is a large optimization space to improve the calibration algorithm. Corner detection of the Chessboard Corner Point Detection is the first step to detect corner points on the image. The chessboard is placed in front of camera. All the corner points are projected into the pixel plane, which is denoted as {xi,yi}\\{x_i, y_i\\}{xi​,yi​}. The experiment environment includes two schemes of the chessboard placement. Layout Indexing Solve the Intrinsic Matrix The Impactness of the Position of Corner Points","categories":[],"tags":[{"name":"Robotics","slug":"Robotics","permalink":"http://example.com/tags/Robotics/"}]},{"title":"Introduction to Functional Analysis","slug":"functional-analysis","date":"2023-07-15T07:17:00.000Z","updated":"2023-09-29T15:56:09.272Z","comments":true,"path":"2023/07/15/functional-analysis/","link":"","permalink":"http://example.com/2023/07/15/functional-analysis/","excerpt":"","text":"Welcome to my blog. This is a series to learning functional analysis. I will writing all my thinking during the learning of function analysis. I am not a math amateur. The reason that I want to learn functional analysis is that I have some tough optimization problems that must be overcome by this kind of mathematical tool. My article is updated in append mode, which means I will append all the content about Chapter 2 in this article rather than write a new article. The reference book for this article is &lt;Linear and Nonlinear Functional Analysis with Applications&gt; and &lt;Introductory Functional Analysis with Applications&gt;. I know it is difficult for me to read all of this book. I am not meant to read all the book in one turn. I just read once, writing down all of the important things of my feelings. It is a introductive reading, a mixing of 75% linear reading and 20% repeatly reading at first, and then 100% repealy reading. The key to learning such textbook is slow and careful! Preliminary about Real Analysis Set of unlimited elements Rational and Irrational Number Measurable Set Measurable Function Convergence of Measurable Function Ergrov Therom Chapter 1 Set Set -&gt; Relationship(mapping) -&gt; Function Set consist of many point. When we have two set, two set then have Relationship, which add some &quot;edges&quot; to the set Some Concept about Sets Equivalence Relation: reftexivity, symmetry, transitivity. Such 3 conditions gurantee provide a &quot;similar&quot; or &quot;equal&quot; testing criterion of R1=R2\\mathcal{R_1} = \\mathcal{R_2}R1​=R2​ Tips：A Equivanlence Relation may include many isolated &quot;sub&quot; equivanlence relations. Two equivalence classes of elements of X are thus either identical(equal) or disjoint(similar). For example, for a modulo operator with the same residue, {(1,1),(4,1),(7,4)...}∪{(2,2),(5,2),(8,5)...}\\{(1,1), (4,1), (7,4)...\\} \\cup \\{(2,2), (5,2), (8,5)...\\}{(1,1),(4,1),(7,4)...}∪{(2,2),(5,2),(8,5)...} P(X)\\mathcal{P}(X)P(X): elements are all the subsets of X. A Equivalence Class of xxx modulo R\\mathcal{R}R: given a x∈Xx \\in Xx∈X, the subset of X defined by x˙:={y∈X;y∼x}\\dot{x}:=\\{y\\in X; y \\sim x\\} x˙:={y∈X;y∼x} where y∼xy \\sim xy∼x means (y,x)∈R(y,x) \\in \\mathcal{R}(y,x)∈R Quotient Set X/RX/\\mathcal{R}X/R: the subset of P(X)\\mathcal{P}(X)P(X) consisting of all equivalence classes modulo R\\mathcal{R}R of elements of X. Cardinal Numbers How to count a set with inifinite elements? Such as the number of rational numbers and irational numbers. Given a relation R\\mathcal{R}R, which means &quot;there exists a bijection of AAA onto BBB&quot;, where AAA and BBB are the subsets of XXX. Such a relation is a equivalence relation R\\mathcal{R}R on set P.\\mathcal{P}.P. The elements of quotient set P(X)/R⊂P(P(X))\\mathcal{P}(X)/R \\subset \\mathcal{P}(\\mathcal{P}(X))P(X)/R⊂P(P(X)) are called cardinal numbers of the subsets of XXX. If AAA is the subset of XXX, its caridnal number, denoted as cardAcard A cardA We can know cardinal number is not a number like Z\\mathbb{Z}Z, R\\mathbb{R}R and C\\mathbb{C}C. It just pick out all the subset of XXX with the same &quot;size&quot;. Chapter 2 Normed Vector Space Vector Space A set XXX is called a vector space over K\\mathbb{K}K when it support addition or scalar(complex or real) multiplication. A subspace of a vector space is any subset of XXX that is also a vector space. A direct sum of subspace Y,ZY,ZY,Z of space XXX if any $x \\in X $ can be written down as x=y+z with y∈Y and z∈Zx = y+z \\ \\ with\\ \\ y\\in Y \\ and\\ z \\in Z x=y+z with y∈Y and z∈Z Example of Vector Space Span ASpan \\ ASpan A： Subspace Spanned by a subset AAA of XXX Let we think more about what does it mean? let we add more hidden symbols left out. A vector space SSS spanned by a subset AAA of XXX is a subspace of XXX. It is consisting of all finite linear combination of vectors of A, i.e., any vector x∈Xx \\in Xx∈X of the form x=∑j∈Jαjajx = \\sum_{j\\in J}{\\alpha_j a_j}x=∑j∈J​αj​aj​, where the set JJJ of indices is finite, and αj∈K\\alpha_j \\in \\mathbb{K}αj​∈K and aj∈Aa_j \\in Aaj​∈A for all j∈jj \\in jj∈j. The first half sentence tells us how to write down a finite linear combination. The second half of the sentense after where ... tells us how to express the formulation in language. Such subspace is denote as: $$ Span\\ A$$ Hamel Basis a Hamel Basis in X is any family (aka. a set of) (ei)i∈I(e_i)_{i \\in I}(ei​)i∈I​ of vectors ei∈Xe_i \\in Xei​∈X satisfing two properties: linearly independent. ∑j∈Jαjej=0=&gt;αj=0\\sum_{j \\in J}{\\alpha_je_j=0} =&gt; \\alpha_j = 0∑j∈J​αj​ej​=0=&gt;αj​=0 Span (ei)i∈I=XSpan \\ (e_i)_{i \\in I} = XSpan (ei​)i∈I​=X Example, the family (en)n=0∞(e_n)^{\\infty}_{n=0}(en​)n=0∞​, where en(x)=xn,x∈Re_n(x)=x^n, x \\in \\mathbb{R}en​(x)=xn,x∈R, constitutes a Hamel basis in the space of all polynomials of one real variable. Theorem 2.1-1 Let X≠{0}X \\neq \\{0\\}X={0} be a vector space THere exists a Hamel basis of X Let EEE and $F be two Hamel Bases of XXX Then, card E=card Fcard\\ E=card\\ Fcard E=card F Chapter 3 Banach Space Banach spaces, i.e. , complete normed vector spaces, play a central role in linear and nonlinear functional analysis.","categories":[{"name":"Math","slug":"Math","permalink":"http://example.com/categories/Math/"}],"tags":[{"name":"Funtional Analysis","slug":"Funtional-Analysis","permalink":"http://example.com/tags/Funtional-Analysis/"}]}],"categories":[{"name":"Diary","slug":"Diary","permalink":"http://example.com/categories/Diary/"},{"name":"Summary","slug":"Summary","permalink":"http://example.com/categories/Summary/"},{"name":"Math","slug":"Math","permalink":"http://example.com/categories/Math/"}],"tags":[{"name":"Weekly Diary","slug":"Weekly-Diary","permalink":"http://example.com/tags/Weekly-Diary/"},{"name":"Daily Summary","slug":"Daily-Summary","permalink":"http://example.com/tags/Daily-Summary/"},{"name":"Robotics","slug":"Robotics","permalink":"http://example.com/tags/Robotics/"},{"name":"Funtional Analysis","slug":"Funtional-Analysis","permalink":"http://example.com/tags/Funtional-Analysis/"}]}